MyHome/src/Documents/ВозвратРасходов/ВозвратРасходов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВозвратРасходов</name>
  <basedOn>Document.РегистрацияРасходов</basedOn>
  <registerRecords>AccumulationRegister.ДоходыРасходы</registerRecords>
  <registerRecords>AccumulationRegister.Расходы</registerRecords>
  <registerRecords>AccumulationRegister.ДвиженияДенежныхСредств</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументРасхода</name>
    <type>
      <types>DocumentRef.РегистрацияРасходов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Расходы</name>
    <attributes>
      <name>Кошелек</name>
      <type>
        <types>CatalogRef.КошелькиИСчета</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяРасходов</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
      </type>
    </attributes>
    <attributes>
      <name>АналитикаРасходов</name>
      <type>
        <types>Characteristic.СтатьиРасходов</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Содержание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОперации</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДокументРасхода</name>
      <type>
        <types>DocumentRef.РегистрацияРасходов</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

MyHome/src/AccumulationRegisters/Расходы/Расходы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Расходы</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>СтатьяРасходов</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АналитикаРасходов</name>
    <type>
      <types>Characteristic.СтатьиРасходов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

MyHome/src/Documents/РегистрацияРасходов/РегистрацияРасходов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РегистрацияРасходов</name>
  <registerRecords>AccumulationRegister.ДоходыРасходы</registerRecords>
  <registerRecords>AccumulationRegister.Расходы</registerRecords>
  <registerRecords>AccumulationRegister.ДвиженияДенежныхСредств</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Расходы</name>
    <attributes>
      <name>ИсточникОплаты</name>
      <type>
        <types>CatalogRef.КошелькиИСчета</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяРасходов</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
      </type>
    </attributes>
    <attributes>
      <name>АналитикаРасходов</name>
      <type>
        <types>Characteristic.СтатьиРасходов</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Содержание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

MyHome/src/Documents/ВозвратРасходов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

Функция ТаблицаРасходовПоДокументамРасхода(ДокументыРасхода) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументыРасхода", ДокументыРасхода);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РегистрацияРасходовРасходы.Кошелек,
	|	РегистрацияРасходовРасходы.СтатьяРасходов,
	|	РегистрацияРасходовРасходы.АналитикаРасходов,
	|	РегистрацияРасходовРасходы.Сумма,
	|	РегистрацияРасходовРасходы.Содержание,
	|	РегистрацияРасходовРасходы.ДатаОперации,
	|	РегистрацияРасходовРасходы.Ссылка КАК ДокументРасхода
	|ИЗ
	|	Документ.РегистрацияРасходов.Расходы КАК РегистрацияРасходовРасходы
	|ГДЕ
	|	РегистрацияРасходовРасходы.Ссылка В (&ДокументыРасхода)";
	
	Таблица = Запрос.Выполнить().Выгрузить();
	
	Возврат Таблица;
	
КонецФункции

Функция ДеревоРасходовЗаПериод(ДатаНачала, ДатаОкончания) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ("""" КАК СТРОКА(1)) КАК ПредставлениеСтроки,
	|	ЛОЖЬ КАК Подобрать,
	|	Расходы.Период КАК ДатаОперации,
	|	Расходы.Регистратор КАК ДокументРасхода,
	|	Расходы.СтатьяРасходов,
	|	Расходы.АналитикаРасходов,
	|	Расходы.Сумма КАК Сумма,
	|	Расходы.Содержание
	|ИЗ
	|	РегистрНакопления.Расходы КАК Расходы
	|ГДЕ
	|	Расходы.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
	|УПОРЯДОЧИТЬ ПО
	|	ДатаОперации,
	|	НомерСтроки
	|ИТОГИ
	|	СУММА(Сумма)
	|ПО
	|	ДокументРасхода";
	
	ДеревоРасходов = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	
	Возврат ДеревоРасходов;
	
КонецФункции

#КонецОбласти

#Область ДвиженияДокумента

Процедура ИнициализироватьТаблицыДляДвижений(ДокументОбъект) Экспорт

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ДокументОбъект.Ссылка);
	Запрос.УстановитьПараметр("ПустаяДата", Дата(1, 1, 1));
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаРасходы.Ссылка КАК Регистратор,
	|	ТаблицаРасходы.ДатаОперации КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ТаблицаРасходы.Кошелек КАК Кошелек,
	|	СУММА(ТаблицаРасходы.Сумма) КАК Сумма
	|ИЗ
	|	Документ.ВозвратРасходов.Расходы КАК ТаблицаРасходы
	|ГДЕ
	|	ТаблицаРасходы.Ссылка = &Ссылка
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаРасходы.Кошелек,
	|	ТаблицаРасходы.Ссылка,
	|	ТаблицаРасходы.ДатаОперации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаРасходы.Ссылка КАК Регистратор,
	|	ТаблицаРасходы.ДатаОперации КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	ТаблицаРасходы.НомерСтроки,
	|	ТаблицаРасходы.СтатьяРасходов КАК СтатьяДоходовРасходов,
	|	-ТаблицаРасходы.Сумма КАК Сумма
	|ИЗ
	|	Документ.ВозвратРасходов.Расходы КАК ТаблицаРасходы
	|ГДЕ
	|	ТаблицаРасходы.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаРасходы.Ссылка КАК Регистратор,
	|	ТаблицаРасходы.ДатаОперации КАК Период,
	|	ТаблицаРасходы.НомерСтроки,
	|	ТаблицаРасходы.СтатьяРасходов КАК СтатьяРасходов,
	|	ТаблицаРасходы.АналитикаРасходов,
	|	ТаблицаРасходы.Содержание КАК Содержание,
	|	-ТаблицаРасходы.Сумма КАК Сумма
	|ИЗ
	|	Документ.ВозвратРасходов.Расходы КАК ТаблицаРасходы
	|ГДЕ
	|	ТаблицаРасходы.Ссылка = &Ссылка";

	РезультатЗапроса = Запрос.ВыполнитьПакет();

	СтруктураРезультата = Новый Структура;
	СтруктураРезультата.Вставить("ТаблицаДвиженияДенежныхСредств", РезультатЗапроса[0].Выгрузить());
	СтруктураРезультата.Вставить("ТаблицаДоходыРасходы", РезультатЗапроса[1].Выгрузить());
	СтруктураРезультата.Вставить("ТаблицаРасходы", РезультатЗапроса[2].Выгрузить());

	ДокументОбъект.ДополнительныеСвойства.Вставить("ТаблицыДляДвижений", СтруктураРезультата);

КонецПроцедуры

Процедура ОтразитьДвиженияДенежныхСредств(Документ, Отказ) Экспорт

	ТаблицаДвижений = Документ.ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаДвиженияДенежныхСредств;

	Если Отказ Или ТаблицаДвижений.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	ДвиженияДенежныхСредств = Документ.Движения.ДвиженияДенежныхСредств;
	ДвиженияДенежныхСредств.Записывать = Истина;
	ДвиженияДенежныхСредств.Загрузить(ТаблицаДвижений);

КонецПроцедуры

Процедура ОтразитьДвиженияДоходыРасходы(Документ, Отказ) Экспорт

	ТаблицаДвижений = Документ.ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаДоходыРасходы;

	Если Отказ Или ТаблицаДвижений.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	ДвиженияДоходыРасходы = Документ.Движения.ДоходыРасходы;
	ДвиженияДоходыРасходы.Записывать = Истина;
	ДвиженияДоходыРасходы.Загрузить(ТаблицаДвижений);

КонецПроцедуры

Процедура ОтразитьДвиженияРасходы(Документ, Отказ) Экспорт

	ТаблицаДвижений = Документ.ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаРасходы;

	Если Отказ Или ТаблицаДвижений.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	ДвиженияРасходы = Документ.Движения.Расходы;
	ДвиженияРасходы.Записывать = Истина;
	ДвиженияРасходы.Загрузить(ТаблицаДвижений);

КонецПроцедуры

#КонецОбласти

#КонецЕсли
